CSI API ETABS v1
cAnalyze.MergeAnalysisResults Method
 Merges analysis results from a given model.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int MergeAnalysisResults(
	string SourceFileName
)
Function MergeAnalysisResults (
	SourceFileName As String
) As Integer
Dim instance As cAnalyze
Dim SourceFileName As String
Dim returnValue As Integer
returnValue = instance.MergeAnalysisResults(SourceFileName)
int MergeAnalysisResults(
	String^ SourceFileName
)
abstract MergeAnalysisResults :
        SourceFileName : string -> int
Parameters
SourceFileName
Type: System.String
 Full path to the model file to import results from.
Return Value
Type: Int32
Returns zero if the results are successfully merged; otherwise it returns a nonzero value.
Remarks
The analysis model is automatically created as part of this function.
See “Merging Analysis Results” section in program help file for requirements and limitations.
IMPORTANT NOTE: Your model must have a file path defined before merging analysis results. If the model is opened from an existing file, a file path is defined. If the model is created from scratch, the File.Save function must be called with a file name before merging analysis results. Saving the file creates the file path.
Examples
Public Sub Example()
   Dim myHelper As cHelper
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
   'create ETABS object
   myHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'run analysis
       System.IO.Directory.CreateDirectory("c:\CSI_API_temp\source")
       ret = SapModel.File.Save("C:\CSI_API_temp\source\model.edb")
       ret = SapModel.Analyze.RunAnalysis
   'initialize a new model
       ret = SapModel.InitializeNewModel()
   'create the same steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'merge analysis results
       ret = SapModel.Analyze.SetSolverOption_2(1, 2, 0)
       System.IO.Directory.CreateDirectory("c:\CSI_API_temp\target")
       ret = SapModel.File.Save("C:\CSI_API_temp\target\model.edb")
       ret = SapModel.Analyze.MergeAnalysisResults("C:\CSI_API_temp\source\model.edb")
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
       myHelper = Nothing
   End Sub
See Also
Reference
cAnalyze Interface
ETABSv1 Namespace